"""

		Машинное обучение - процеесЮ в котором тосность работы компьютера повышется по мере сбора даннх и извлечения из их информации.

		Рассмотренная информация в этом каталоге и примеры - ориентированы на обработку данных в оперативной памяти компьютера,
		что означает, то данные имеют не такой болшой объем.
		 
		Типы:
			Контролируемое - человек помогает распознать некотрые данные (Распознавание чисел)
			Неконтролируемое - без участия еловека
			Частитчно контролируемое - медиана 1го и 2го. 
																	К примеру: 
																		Программа сообщает какие именно значения она хотела бы увидеть как помеченные из всего набора.



			
"""