"""

		Ресурсы и инструменты:

			JQuery
			Crossfilter.js - Библиотека MapReduce для dc.js
			d3.js - Библиотека визуализации данных для dc.js
			dc.js - Блибоиотека визуализации для создания интерактивных панелей
			Bootstrap - Библиотека макетирования

			python Simple Web-server - чтобы все это заработало (в частности - для подгрузки csv файла)


		Полезные ресусры:

			Chartkick - библиотека построения JS-диаграмм для люббителей Ruby On Rails
			d3.js - Библиотека ВИЗУАЛИЗАЦИИ ДАННЫХ (не построения диаграмм), Визуализация
							подразумевает работу даже с неопределенными данными.

"""